tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18324_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF18324_H_
#define _PIC16LF18324_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define INTEDG                        25
#define PEIE                          26
#define GIE                           27
#define PORTA                         28
#define RA0                           29
#define RA1                           30
#define RA2                           31
#define RA3                           32
#define RA4                           33
#define RA5                           34
#define PORTC                         35
#define RC0                           36
#define RC1                           37
#define RC2                           38
#define RC3                           39
#define RC4                           40
#define RC5                           41
#define PIR0                          42
#define INTF                          43
#define IOCIF                         44
#define TMR0IF                        45
#define PIR1                          46
#define TMR1IF                        47
#define TMR2IF                        48
#define BCL1IF                        49
#define SSP1IF                        50
#define TXIF                          51
#define RCIF                          52
#define ADIF                          53
#define TMR1GIF                       54
#define PIR2                          55
#define NCO1IF                        56
#define TMR4IF                        57
#define NVMIF                         58
#define C1IF                          59
#define C2IF                          60
#define TMR6IF                        61
#define PIR3                          62
#define CLC1IF                        63
#define CLC2IF                        64
#define CLC3IF                        65
#define CLC4IF                        66
#define TMR3IF                        67
#define TMR3GIF                       68
#define CSWIF                         69
#define OSFIF                         70
#define PIR4                          71
#define CCP1IF                        72
#define CCP2IF                        73
#define CCP3IF                        74
#define CCP4IF                        75
#define TMR5IF                        76
#define TMR5GIF                       77
#define CWG1IF                        78
#define CWG2IF                        79
#define TMR00                         80
#define TMR0L                         81
#define TMR01                         82
#define TMR02                         83
#define TMR03                         84
#define TMR04                         85
#define TMR05                         86
#define TMR06                         87
#define TMR07                         88
#define TMR08                         89
#define TMR0H                         90
#define TMR09                         91
#define TMR010                        92
#define TMR011                        93
#define TMR012                        94
#define TMR013                        95
#define TMR014                        96
#define TMR015                        97
#define T0CON0                        98
#define T0OUTPS                       99
#define T0OUTPS0                      100
#define T0OUTPS1                      101
#define T0OUTPS2                      102
#define T0OUTPS3                      103
#define T016BIT                       104
#define T0OUT                         105
#define T0EN                          106
#define T0CON1                        107
#define T0CKPS                        108
#define T0CKPS0                       109
#define T0CKPS1                       110
#define T0CKPS2                       111
#define T0CKPS3                       112
#define T0ASYNC                       113
#define T0CS                          114
#define T0CS0                         115
#define T0CS1                         116
#define T0CS2                         117
#define TMR1L                         118
#define TMR1H                         119
#define T1CON                         120
#define TMR1ON                        121
#define T1SYNC                        122
#define T1SOSC                        123
#define T1CKPS0                       124
#define T1CKPS                        125
#define T1CKPS1                       126
#define TMR1CS0                       127
#define TMR1CS                        128
#define TMR1CS1                       129
#define T1GCON                        130
#define T1GSS0                        131
#define T1GSS                         132
#define T1GSS1                        133
#define T1GVAL                        134
#define T1GGO_nDONE                   135
#define T1GSPM                        136
#define T1GTM                         137
#define T1GPOL                        138
#define TMR1GE                        139
#define TMR2                          140
#define PR2                           141
#define T2CON                         142
#define T2CKPS0                       143
#define T2CKPS                        144
#define T2CKPS1                       145
#define TMR2ON                        146
#define T2OUTPS0                      147
#define T2OUTPS                       148
#define T2OUTPS1                      149
#define T2OUTPS2                      150
#define T2OUTPS3                      151
#define TRISA                         152
#define TRISA0                        153
#define TRISA1                        154
#define TRISA2                        155
#define TRISA4                        156
#define TRISA5                        157
#define TRISC                         158
#define TRISC0                        159
#define TRISC1                        160
#define TRISC2                        161
#define TRISC3                        162
#define TRISC4                        163
#define TRISC5                        164
#define PIE0                          165
#define INTE                          166
#define IOCIE                         167
#define TMR0IE                        168
#define PIE1                          169
#define TMR1IE                        170
#define TMR2IE                        171
#define BCL1IE                        172
#define SSP1IE                        173
#define TXIE                          174
#define RCIE                          175
#define ADIE                          176
#define TMR1GIE                       177
#define PIE2                          178
#define NCO1IE                        179
#define TMR4IE                        180
#define NVMIE                         181
#define C1IE                          182
#define C2IE                          183
#define TMR6IE                        184
#define PIE3                          185
#define CLC1IE                        186
#define CLC2IE                        187
#define CLC3IE                        188
#define CLC4IE                        189
#define TMR3IE                        190
#define TMR3GIE                       191
#define CSWIE                         192
#define OSFIE                         193
#define PIE4                          194
#define CCP1IE                        195
#define CCP2IE                        196
#define CCP3IE                        197
#define CCP4IE                        198
#define TMR5IE                        199
#define TMR5GIE                       200
#define CWG1IE                        201
#define CWG2IE                        202
#define WDTCON                        203
#define SWDTEN                        204
#define WDTPS                         205
#define WDTPS0                        206
#define WDTPS1                        207
#define WDTPS2                        208
#define WDTPS3                        209
#define WDTPS4                        210
#define ADRESL                        211
#define ADRESH                        212
#define ADCON0                        213
#define ADON                          214
#define GO_nDONE                      215
#define GO                            216
#define ADGO                          217
#define CHS0                          218
#define CHS                           219
#define CHS1                          220
#define CHS2                          221
#define CHS3                          222
#define CHS4                          223
#define CHS5                          224
#define ADCON1                        225
#define ADPREF0                       226
#define ADPREF                        227
#define ADPREF1                       228
#define ADNREF                        229
#define ADCS0                         230
#define ADCS                          231
#define ADCS1                         232
#define ADCS2                         233
#define ADFM                          234
#define ADACT0                        235
#define ADACT                         236
#define ADACT1                        237
#define ADACT2                        238
#define ADACT3                        239
#define ADACT4                        240
#define LATA                          241
#define LATA0                         242
#define LATA1                         243
#define LATA2                         244
#define LATA4                         245
#define LATA5                         246
#define LATC                          247
#define LATC0                         248
#define LATC1                         249
#define LATC2                         250
#define LATC3                         251
#define LATC4                         252
#define LATC5                         253
#define CM1CON0                       254
#define C1SYNC                        255
#define C1HYS                         256
#define C1SP                          257
#define C1POL                         258
#define C1OUT                         259
#define C1ON                          260
#define CM1CON1                       261
#define C1NCH0                        262
#define C1NCH                         263
#define C1NCH1                        264
#define C1NCH2                        265
#define C1PCH                         266
#define C1PCH0                        267
#define C1PCH1                        268
#define C1PCH2                        269
#define C1INTN                        270
#define C1INTP                        271
#define CM2CON0                       272
#define C2SYNC                        273
#define C2HYS                         274
#define C2SP                          275
#define C2POL                         276
#define C2OUT                         277
#define C2ON                          278
#define CM2CON1                       279
#define C2NCH0                        280
#define C2NCH                         281
#define C2NCH1                        282
#define C2NCH2                        283
#define C2PCH                         284
#define C2PCH0                        285
#define C2PCH1                        286
#define C2PCH2                        287
#define C2INTN                        288
#define C2INTP                        289
#define CMOUT                         290
#define MC1OUT                        291
#define MC2OUT                        292
#define BORCON                        293
#define BORRDY                        294
#define SBOREN                        295
#define FVRCON                        296
#define ADFVR0                        297
#define ADFVR                         298
#define ADFVR1                        299
#define CDAFVR                        300
#define CDAFVR0                       301
#define CDAFVR1                       302
#define TSRNG                         303
#define TSEN                          304
#define FVRRDY                        305
#define FVREN                         306
#define DACCON0                       307
#define DAC1NSS                       308
#define DAC1PSS                       309
#define DAC1PSS0                      310
#define DAC1PSS1                      311
#define DAC1OE                        312
#define DAC1EN                        313
#define DACCON1                       314
#define DAC1R                         315
#define DAC1R0                        316
#define DAC1R1                        317
#define DAC1R2                        318
#define DAC1R3                        319
#define DAC1R4                        320
#define ANSELA                        321
#define ANSA0                         322
#define ANSA1                         323
#define ANSA2                         324
#define ANSA4                         325
#define ANSA5                         326
#define ANSELC                        327
#define ANSC0                         328
#define ANSC1                         329
#define ANSC2                         330
#define ANSC3                         331
#define ANSC4                         332
#define ANSC5                         333
#define RC1REG                        334
#define TX1REG                        335
#define SP1BRGL                       336
#define SP1BRGH                       337
#define RC1STA                        338
#define RX9D                          339
#define OERR                          340
#define FERR                          341
#define ADDEN                         342
#define CREN                          343
#define SREN                          344
#define RX9                           345
#define SPEN                          346
#define TX1STA                        347
#define TX9D                          348
#define TRMT                          349
#define BRGH                          350
#define SENDB                         351
#define SYNC                          352
#define TXEN                          353
#define TX9                           354
#define CSRC                          355
#define BAUD1CON                      356
#define ABDEN                         357
#define WUE                           358
#define BRG16                         359
#define SCKP                          360
#define RCIDL                         361
#define ABDOVF                        362
#define WPUA                          363
#define WPUA0                         364
#define WPUA1                         365
#define WPUA2                         366
#define WPUA3                         367
#define WPUA4                         368
#define WPUA5                         369
#define WPUC                          370
#define WPUC0                         371
#define WPUC1                         372
#define WPUC2                         373
#define WPUC3                         374
#define WPUC4                         375
#define WPUC5                         376
#define SSP1BUF                       377
#define BUF                           378
#define BUF0                          379
#define SSP1BUF0                      380
#define BUF1                          381
#define SSP1BUF1                      382
#define BUF2                          383
#define SSP1BUF2                      384
#define BUF3                          385
#define SSP1BUF3                      386
#define BUF4                          387
#define SSP1BUF4                      388
#define BUF5                          389
#define SSP1BUF5                      390
#define BUF6                          391
#define SSP1BUF6                      392
#define BUF7                          393
#define SSP1BUF7                      394
#define ADD0                          395
#define ADD                           396
#define SSP1ADD0                      397
#define SSP1ADD                       398
#define ADD1                          399
#define SSP1ADD1                      400
#define ADD2                          401
#define SSP1ADD2                      402
#define ADD3                          403
#define SSP1ADD3                      404
#define ADD4                          405
#define SSP1ADD4                      406
#define ADD5                          407
#define SSP1ADD5                      408
#define ADD6                          409
#define SSP1ADD6                      410
#define ADD7                          411
#define SSP1ADD7                      412
#define SSP1MSK0                      413
#define SSP1MSK                       414
#define MSK0                          415
#define MSK                           416
#define SSP1MSK1                      417
#define MSK1                          418
#define SSP1MSK2                      419
#define MSK2                          420
#define SSP1MSK3                      421
#define MSK3                          422
#define SSP1MSK4                      423
#define MSK4                          424
#define SSP1MSK5                      425
#define MSK5                          426
#define SSP1MSK6                      427
#define MSK6                          428
#define SSP1MSK7                      429
#define MSK7                          430
#define SSP1STAT                      431
#define BF                            432
#define UA                            433
#define R_nW                          434
#define S                             435
#define P                             436
#define D_nA                          437
#define CKE                           438
#define SMP                           439
#define SSP1CON1                      440
#define SSPM0                         441
#define SSPM                          442
#define SSPM1                         443
#define SSPM2                         444
#define SSPM3                         445
#define CKP                           446
#define SSPEN                         447
#define SSPOV                         448
#define WCOL                          449
#define SSP1CON2                      450
#define SEN                           451
#define RSEN                          452
#define PEN                           453
#define RCEN                          454
#define ACKEN                         455
#define ACKDT                         456
#define ACKSTAT                       457
#define GCEN                          458
#define SSP1CON3                      459
#define DHEN                          460
#define AHEN                          461
#define SBCDE                         462
#define SDAHT                         463
#define BOEN                          464
#define SCIE                          465
#define PCIE                          466
#define ACKTIM                        467
#define ODCONA                        468
#define ODCA0                         469
#define ODCA1                         470
#define ODCA2                         471
#define ODCA4                         472
#define ODCA5                         473
#define ODCONC                        474
#define ODCC0                         475
#define ODCC1                         476
#define ODCC2                         477
#define ODCC3                         478
#define ODCC4                         479
#define ODCC5                         480
#define CCPR1L                        481
#define CCPR1H                        482
#define CCP1CON                       483
#define CCP1MODE                      484
#define CCP1MODE0                     485
#define CCP1MODE1                     486
#define CCP1MODE2                     487
#define CCP1MODE3                     488
#define CCP1FMT                       489
#define CCP1OUT                       490
#define CCP1EN                        491
#define CCP1CAP                       492
#define CCP1CTS                       493
#define CCP1CTS0                      494
#define CCP1CTS1                      495
#define CCP1CTS2                      496
#define CCP1CTS3                      497
#define CCPR2L                        498
#define CCPR2H                        499
#define CCP2CON                       500
#define CCP2MODE                      501
#define CCP2MODE0                     502
#define CCP2MODE1                     503
#define CCP2MODE2                     504
#define CCP2MODE3                     505
#define CCP2FMT                       506
#define CCP2OUT                       507
#define CCP2EN                        508
#define CCP2CAP                       509
#define CCP2CTS                       510
#define CCP2CTS0                      511
#define CCP2CTS1                      512
#define CCP2CTS2                      513
#define CCP2CTS3                      514
#define CCPTMRS                       515
#define C1TSEL0                       516
#define C1TSEL                        517
#define C1TSEL1                       518
#define C2TSEL0                       519
#define C2TSEL                        520
#define C2TSEL1                       521
