tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18324_tdd.h
#define C3TSEL0                       522
#define C3TSEL                        523
#define C3TSEL1                       524
#define C4TSEL                        525
#define C4TSEL0                       526
#define C4TSEL1                       527
#define SLRCONA                       528
#define SLRA0                         529
#define SLRA1                         530
#define SLRA2                         531
#define SLRA4                         532
#define SLRA5                         533
#define SLRCONC                       534
#define SLRC0                         535
#define SLRC1                         536
#define SLRC2                         537
#define SLRC3                         538
#define SLRC4                         539
#define SLRC5                         540
#define CCPR3L                        541
#define CCPR3H                        542
#define CCP3CON                       543
#define CCP3MODE0                     544
#define CCP3MODE                      545
#define CCP3MODE1                     546
#define CCP3MODE2                     547
#define CCP3MODE3                     548
#define CCP3FMT                       549
#define CCP3OUT                       550
#define CCP3EN                        551
#define CCP3CAP                       552
#define CCP3CTS                       553
#define CCP3CTS0                      554
#define CCP3CTS1                      555
#define CCP3CTS2                      556
#define CCP3CTS3                      557
#define CCPR4L                        558
#define CCPR4H                        559
#define CCP4CON                       560
#define CCP4MODE                      561
#define CCP4MODE0                     562
#define CCP4MODE1                     563
#define CCP4MODE2                     564
#define CCP4MODE3                     565
#define CCP4FMT                       566
#define CCP4OUT                       567
#define CCP4EN                        568
#define CCP4CAP                       569
#define CCP4CTS                       570
#define CCP4CTS0                      571
#define CCP4CTS1                      572
#define CCP4CTS2                      573
#define CCP4CTS3                      574
#define INLVLA                        575
#define INLVLA0                       576
#define INLVLA1                       577
#define INLVLA2                       578
#define INLVLA3                       579
#define INLVLA4                       580
#define INLVLA5                       581
#define INLVLC                        582
#define INLVLC0                       583
#define INLVLC1                       584
#define INLVLC2                       585
#define INLVLC3                       586
#define INLVLC4                       587
#define INLVLC5                       588
#define IOCAP                         589
#define IOCAP0                        590
#define IOCAP1                        591
#define IOCAP2                        592
#define IOCAP3                        593
#define IOCAP4                        594
#define IOCAP5                        595
#define IOCAN                         596
#define IOCAN0                        597
#define IOCAN1                        598
#define IOCAN2                        599
#define IOCAN3                        600
#define IOCAN4                        601
#define IOCAN5                        602
#define IOCAF                         603
#define IOCAF0                        604
#define IOCAF1                        605
#define IOCAF2                        606
#define IOCAF3                        607
#define IOCAF4                        608
#define IOCAF5                        609
#define IOCCP                         610
#define IOCCP0                        611
#define IOCCP1                        612
#define IOCCP2                        613
#define IOCCP3                        614
#define IOCCP4                        615
#define IOCCP5                        616
#define IOCCN                         617
#define IOCCN0                        618
#define IOCCN1                        619
#define IOCCN2                        620
#define IOCCN3                        621
#define IOCCN4                        622
#define IOCCN5                        623
#define IOCCF                         624
#define IOCCF0                        625
#define IOCCF1                        626
#define IOCCF2                        627
#define IOCCF3                        628
#define IOCCF4                        629
#define IOCCF5                        630
#define CLKRCON                       631
#define CLKRDIV                       632
#define CLKRDIV0                      633
#define CLKRDIV1                      634
#define CLKRDIV2                      635
#define CLKRDC                        636
#define CLKRDC0                       637
#define CLKRDC1                       638
#define CLKREN                        639
#define MDCON                         640
#define MDBIT                         641
#define MDOUT                         642
#define MDOPOL                        643
#define MDEN                          644
#define MDSRC                         645
#define MDMS0                         646
#define MDMS                          647
#define MDMS1                         648
#define MDMS2                         649
#define MDMS3                         650
#define MDCARH                        651
#define MDCH                          652
#define MDCH0                         653
#define MDCH1                         654
#define MDCH2                         655
#define MDCH3                         656
#define MDCHSYNC                      657
#define MDCHPOL                       658
#define MDCARL                        659
#define MDCL0                         660
#define MDCL                          661
#define MDCL1                         662
#define MDCL2                         663
#define MDCL3                         664
#define MDCLSYNC                      665
#define MDCLPOL                       666
#define CCDNA                         667
#define CCDNA0                        668
#define CCDNA1                        669
#define CCDNA2                        670
#define CCDNA4                        671
#define CCDNA5                        672
#define CCDNC                         673
#define CCDNC0                        674
#define CCDNC1                        675
#define CCDNC2                        676
#define CCDNC3                        677
#define CCDNC4                        678
#define CCDNC5                        679
#define TMR3L                         680
#define TMR3H                         681
#define T3CON                         682
#define TMR3ON                        683
#define T3SYNC                        684
#define T3SOSC                        685
#define T3CKPS                        686
#define T3CKPS0                       687
#define T3CKPS1                       688
#define TMR3CS0                       689
#define TMR3CS                        690
#define TMR3CS1                       691
#define T3GCON                        692
#define T3GSS0                        693
#define T3GSS                         694
#define T3GSS1                        695
#define T3GVAL                        696
#define T3GGO_nDONE                   697
#define T3GSPM                        698
#define T3GTM                         699
#define T3GPOL                        700
#define TMR3GE                        701
#define TMR4                          702
#define PR4                           703
#define T4CON                         704
#define T4CKPS0                       705
#define T4CKPS                        706
#define T4CKPS1                       707
#define TMR4ON                        708
#define T4OUTPS                       709
#define T4OUTPS0                      710
#define T4OUTPS1                      711
#define T4OUTPS2                      712
#define T4OUTPS3                      713
#define TMR5L                         714
#define TMR5H                         715
#define T5CON                         716
#define TMR5ON                        717
#define T5SYNC                        718
#define T5SOSC                        719
#define T5CKPS                        720
#define T5CKPS0                       721
#define T5CKPS1                       722
#define TMR5CS0                       723
#define TMR5CS                        724
#define TMR5CS1                       725
#define T5GCON                        726
#define T5GSS                         727
#define T5GSS0                        728
#define T5GSS1                        729
#define T5GVAL                        730
#define T5GGO_nDONE                   731
#define T5GSPM                        732
#define T5GTM                         733
#define T5GPOL                        734
#define TMR5GE                        735
#define TMR6                          736
#define PR6                           737
#define T6CON                         738
#define T6CKPS0                       739
#define T6CKPS                        740
#define T6CKPS1                       741
#define TMR6ON                        742
#define T6OUTPS0                      743
#define T6OUTPS                       744
#define T6OUTPS1                      745
#define T6OUTPS2                      746
#define T6OUTPS3                      747
#define CCDCON                        748
#define CCDS                          749
#define CCDS0                         750
#define CCDS1                         751
#define CCDEN                         752
#define CCDPA                         753
#define CCDPA0                        754
#define CCDPA1                        755
#define CCDPA2                        756
#define CCDPA4                        757
#define CCDPA5                        758
#define CCDPC                         759
#define CCDPC0                        760
#define CCDPC1                        761
#define CCDPC2                        762
#define CCDPC3                        763
#define CCDPC4                        764
#define CCDPC5                        765
#define NCO1ACCL                      766
#define NCO1ACCL_NCO1ACC              767
#define NCO1ACCH                      768
#define NCO1ACCH_NCO1ACC              769
#define NCO1ACCU                      770
#define NCO1ACCU_NCO1ACC              771
#define NCO1INCL                      772
#define NCO1INCL_NCO1INC              773
#define NCO1INCH                      774
#define NCO1INCH_NCO1INC              775
#define NCO1INCU                      776
#define NCO1INCU_NCO1INC              777
#define NCO1CON                       778
#define N1PFM                         779
#define N1POL                         780
#define N1OUT                         781
#define N1EN                          782
#define NCO1CLK                       783
#define N1CKS                         784
#define N1PWS                         785
#define PWM5DCL                       786
#define PWM5DCL0                      787
#define PWM5DCL1                      788
#define PWM5DCH                       789
#define PWM5DCH0                      790
#define PWM5DCH1                      791
#define PWM5DCH2                      792
#define PWM5DCH3                      793
#define PWM5DCH4                      794
#define PWM5DCH5                      795
#define PWM5DCH6                      796
#define PWM5DCH7                      797
#define PWM5CON                       798
#define PWM5POL                       799
#define PWM5OUT                       800
#define PWM5EN                        801
#define PWM6DCL                       802
#define PWM6DCL0                      803
#define PWM6DCL1                      804
#define PWM6DCH                       805
#define PWM6DCH0                      806
#define PWM6DCH1                      807
#define PWM6DCH2                      808
#define PWM6DCH3                      809
#define PWM6DCH4                      810
#define PWM6DCH5                      811
#define PWM6DCH6                      812
#define PWM6DCH7                      813
#define PWM6CON                       814
#define PWM6POL                       815
#define PWM6OUT                       816
#define PWM6EN                        817
#define PWMTMRS                       818
#define P5TSEL                        819
#define P5TSEL0                       820
#define P5TSEL1                       821
#define P6TSEL0                       822
#define P6TSEL                        823
#define P6TSEL1                       824
#define CWG1CLKCON                    825
#define CWG1CLKCON_CS                 826
#define CWG1CS                        827
#define CWG1DAT                       828
#define CWG1DAT_DAT                   829
#define CWG1DAT0                      830
#define CWG1DAT1                      831
#define CWG1DAT2                      832
#define CWG1DAT3                      833
#define CWG1DBR_DBR                   834
#define CWG1DBR0                      835
#define CWG1DBR_DBR0                  836
#define CWG1DBR                       837
#define CWG1DBR1                      838
#define CWG1DBR_DBR1                  839
#define CWG1DBR2                      840
#define CWG1DBR_DBR2                  841
#define CWG1DBR3                      842
#define CWG1DBR_DBR3                  843
#define CWG1DBR_DBR4                  844
#define CWG1DBR4                      845
#define CWG1DBR5                      846
#define CWG1DBR_DBR5                  847
#define CWG1DBF                       848
#define CWG1DBF0                      849
#define CWG1DBF_DBF                   850
#define CWG1DBF_DBF0                  851
#define CWG1DBF1                      852
#define CWG1DBF_DBF1                  853
#define CWG1DBF_DBF2                  854
#define CWG1DBF2                      855
#define CWG1DBF3                      856
#define CWG1DBF_DBF3                  857
#define CWG1DBF_DBF4                  858
#define CWG1DBF4                      859
#define CWG1DBF_DBF5                  860
#define CWG1DBF5                      861
#define CWG1CON0                      862
#define CWG1MODE0                     863
#define CWG1CON0_MODE                 864
#define CWG1CON0_MODE0                865
#define CWG1MODE                      866
#define CWG1MODE1                     867
#define CWG1CON0_MODE1                868
#define CWG1MODE2                     869
#define CWG1CON0_MODE2                870
#define CWG1CON0_LD                   871
#define CWG1LD                        872
#define CWG1EN                        873
#define G1EN                          874
#define CWG1CON0_EN                   875
#define CWG1CON1                      876
#define CWG1POLA                      877
#define CWG1CON1_POLA                 878
#define CWG1CON1_POLB                 879
#define CWG1POLB                      880
#define CWG1POLC                      881
#define CWG1CON1_POLC                 882
#define CWG1CON1_POLD                 883
#define CWG1POLD                      884
#define CWG1CON1_IN                   885
#define CWG1IN                        886
#define CWG1AS0                       887
#define CWG1LSAC                      888
#define CWG1AS0_LSAC0                 889
#define CWG1AS0_LSAC                  890
#define CWG1LSAC0                     891
#define CWG1AS0_LSAC1                 892
#define CWG1LSAC1                     893
#define CWG1AS0_LSBD0                 894
#define CWG1LSBD0                     895
#define CWG1LSBD                      896
#define CWG1AS0_LSBD                  897
#define CWG1LSBD1                     898
#define CWG1AS0_LSBD1                 899
#define CWG1AS0_REN                   900
#define CWG1REN                       901
#define CWG1AS0_SHUTDOWN              902
#define CWG1SHUTDOWN                  903
#define CWG1AS1                       904
#define CWG1AS1_AS0E                  905
#define CWG1AS1_AS1E                  906
#define CWG1AS1_AS2E                  907
#define CWG1AS1_AS3E                  908
#define CWG1AS1_AS4E                  909
#define CWG1STR                       910
#define CWG1STRA                      911
#define CWG1STR_STRA                  912
#define CWG1STRB                      913
#define CWG1STR_STRB                  914
#define CWG1STRC                      915
#define CWG1STR_STRC                  916
#define CWG1STR_STRD                  917
#define CWG1STRD                      918
#define CWG1OVRA                      919
#define CWG1STR_OVRA                  920
#define CWG1OVRB                      921
#define CWG1STR_OVRB                  922
#define CWG1OVRC                      923
#define CWG1STR_OVRC                  924
#define CWG1OVRD                      925
#define CWG1STR_OVRD                  926
#define CWG2CLKCON                    927
#define CWG2CS                        928
#define CWG2CLKCON_CS                 929
#define CWG2DAT                       930
#define CWG2DAT0                      931
#define CWG2DAT_DAT                   932
#define CWG2DAT1                      933
#define CWG2DAT2                      934
#define CWG2DAT3                      935
#define CWG2DBR_DBR                   936
#define CWG2DBR_DBR0                  937
#define CWG2DBR                       938
#define CWG2DBR0                      939
#define CWG2DBR_DBR1                  940
#define CWG2DBR1                      941
#define CWG2DBR_DBR2                  942
#define CWG2DBR2                      943
#define CWG2DBR_DBR3                  944
#define CWG2DBR3                      945
#define CWG2DBR_DBR4                  946
#define CWG2DBR4                      947
#define CWG2DBR_DBR5                  948
#define CWG2DBR5                      949
#define CWG2DBF                       950
#define CWG2DBF_DBF0                  951
#define CWG2DBF_DBF                   952
#define CWG2DBF0                      953
#define CWG2DBF_DBF1                  954
#define CWG2DBF1                      955
#define CWG2DBF_DBF2                  956
#define CWG2DBF2                      957
#define CWG2DBF_DBF3                  958
#define CWG2DBF3                      959
#define CWG2DBF_DBF4                  960
#define CWG2DBF4                      961
#define CWG2DBF5                      962
#define CWG2DBF_DBF5                  963
#define CWG2CON0                      964
#define CWG2MODE                      965
#define CWG2MODE0                     966
#define CWG2CON0_MODE                 967
#define CWG2CON0_MODE0                968
#define CWG2MODE1                     969
#define CWG2CON0_MODE1                970
#define CWG2MODE2                     971
#define CWG2CON0_MODE2                972
#define CWG2LD                        973
#define CWG2CON0_LD                   974
#define CWG2CON0_EN                   975
#define CWG2EN                        976
#define G2EN                          977
#define CWG2CON1                      978
#define CWG2POLA                      979
#define CWG2CON1_POLA                 980
#define CWG2POLB                      981
#define CWG2CON1_POLB                 982
#define CWG2POLC                      983
#define CWG2CON1_POLC                 984
#define CWG2CON1_POLD                 985
#define CWG2POLD                      986
#define CWG2IN                        987
#define CWG2CON1_IN                   988
#define CWG2AS0                       989
#define CWG2LSAC                      990
#define CWG2AS0_LSAC                  991
#define CWG2LSAC0                     992
#define CWG2AS0_LSAC0                 993
#define CWG2LSAC1                     994
#define CWG2AS0_LSAC1                 995
#define CWG2AS0_LSBD0                 996
#define CWG2LSBD                      997
#define CWG2AS0_LSBD                  998
#define CWG2LSBD0                     999
#define CWG2AS0_LSBD1                 1000
#define CWG2LSBD1                     1001
#define CWG2AS0_REN                   1002
#define CWG2REN                       1003
#define CWG2AS0_SHUTDOWN              1004
#define CWG2SHUTDOWN                  1005
#define CWG2AS1                       1006
#define CWG2AS1_AS0E                  1007
#define CWG2AS1_AS1E                  1008
#define CWG2AS1_AS2E                  1009
#define CWG2AS1_AS3E                  1010
#define CWG2AS1_AS4E                  1011
#define CWG2STR                       1012
#define CWG2STR_STRA                  1013
#define CWG2STRA                      1014
#define CWG2STR_STRB                  1015
#define CWG2STRB                      1016
#define CWG2STR_STRC                  1017
#define CWG2STRC                      1018
#define CWG2STR_STRD                  1019
#define CWG2STRD                      1020
#define CWG2STR_OVRA                  1021
#define CWG2OVRA                      1022
#define CWG2OVRB                      1023
#define CWG2STR_OVRB                  1024
#define CWG2STR_OVRC                  1025
#define CWG2OVRC                      1026
#define CWG2OVRD                      1027
#define CWG2STR_OVRD                  1028
#define NVMADR0                       1029
#define NVMADRL                       1030
#define NVMADR1                       1031
#define NVMADR2                       1032
#define NVMADR3                       1033
#define NVMADR4                       1034
#define NVMADR5                       1035
#define NVMADR6                       1036
#define NVMADR7                       1037
#define NVMADR8                       1038
#define NVMADRH                       1039
#define NVMADR9                       1040
#define NVMADR10                      1041
#define NVMADR11                      1042
#define NVMADR12                      1043
#define NVMADR13                      1044
#define NVMADR14                      1045
#define NVMDAT0                       1046
#define NVMDATL                       1047
#define NVMDAT1                       1048
#define NVMDAT2                       1049
#define NVMDAT3                       1050
#define NVMDAT4                       1051
#define NVMDAT5                       1052
#define NVMDAT6                       1053
#define NVMDAT7                       1054
#define NVMDAT8                       1055
#define NVMDATH                       1056
#define NVMDAT9                       1057
#define NVMDAT10                      1058
#define NVMDAT11                      1059
#define NVMDAT12                      1060
#define NVMDAT13                      1061
#define NVMCON1                       1062
#define RD                            1063
#define WR                            1064
#define WREN                          1065
#define WRERR                         1066
#define FREE                          1067
#define LWLO                          1068
#define NVMREGS                       1069
#define NVMCON2                       1070
#define NMVCON2                       1071
#define PCON0                         1072
#define nBOR                          1073
#define nPOR                          1074
#define nRI                           1075
#define nRMCLR                        1076
#define nRWDT                         1077
#define STKUNF                        1078
#define STKOVF                        1079
#define PMD0                          1080
#define IOCMD                         1081
#define CLKRMD                        1082
#define NVMMD                         1083
#define FVRMD                         1084
#define SYSCMD                        1085
#define PMD1                          1086
#define TMR0MD                        1087
#define TMR1MD                        1088
#define TMR2MD                        1089
#define TMR3MD                        1090
