tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18324_tdd.h
#define TMR4MD                        1091
#define TMR5MD                        1092
#define TMR6MD                        1093
#define NCOMD                         1094
#define PMD2                          1095
#define CMP1MD                        1096
#define CMP2MD                        1097
#define ADCMD                         1098
#define DACMD                         1099
#define PMD3                          1100
#define CCP1MD                        1101
#define CCP2MD                        1102
#define CCP3MD                        1103
#define CCP4MD                        1104
#define PWM5MD                        1105
#define PWM6MD                        1106
#define CWG1MD                        1107
#define CWG2MD                        1108
#define PMD4                          1109
#define MSSP1MD                       1110
#define UART1MD                       1111
#define PMD5                          1112
#define DSMMD                         1113
#define CLC1MD                        1114
#define CLC2MD                        1115
#define CLC3MD                        1116
#define CLC4MD                        1117
#define CPUDOZE                       1118
#define DOZE0                         1119
#define DOZE                          1120
#define DOZE1                         1121
#define DOZE2                         1122
#define DOE                           1123
#define ROI                           1124
#define DOZEN                         1125
#define IDLEN                         1126
#define OSCCON1                       1127
#define NDIV0                         1128
#define NDIV                          1129
#define NDIV1                         1130
#define NDIV2                         1131
#define NDIV3                         1132
#define NOSC0                         1133
#define NOSC                          1134
#define NOSC1                         1135
#define NOSC2                         1136
#define OSCCON2                       1137
#define CDIV0                         1138
#define CDIV                          1139
#define CDIV1                         1140
#define CDIV2                         1141
#define CDIV3                         1142
#define COSC                          1143
#define COSC0                         1144
#define COSC1                         1145
#define COSC2                         1146
#define OSCCON3                       1147
#define NOSCR                         1148
#define ORDY                          1149
#define SOSCBE                        1150
#define SOSCPWR                       1151
#define CSWHOLD                       1152
#define OSCSTAT1                      1153
#define PLLR                          1154
#define ADOR                          1155
#define SOR                           1156
#define LFOR                          1157
#define HFOR                          1158
#define EXTOR                         1159
#define OSCEN                         1160
#define ADOEN                         1161
#define SOSCEN                        1162
#define LFOEN                         1163
#define HFOEN                         1164
#define EXTOEN                        1165
#define OSCTUNE                       1166
#define HFTUN0                        1167
#define HFTUN                         1168
#define HFTUN1                        1169
#define HFTUN2                        1170
#define HFTUN3                        1171
#define HFTUN4                        1172
#define HFTUN5                        1173
#define OSCFRQ                        1174
#define HFFRQ                         1175
#define HFFRQ0                        1176
#define HFFRQ1                        1177
#define HFFRQ2                        1178
#define HFFRQ3                        1179
#define PPSLOCK                       1180
#define PPSLOCKED                     1181
#define INTPPS0                       1182
#define INTPPS                        1183
#define INTPPS1                       1184
#define INTPPS2                       1185
#define INTPPS3                       1186
#define INTPPS4                       1187
#define T0CKIPPS0                     1188
#define T0CKIPPS                      1189
#define T0CKIPPS1                     1190
#define T0CKIPPS2                     1191
#define T0CKIPPS3                     1192
#define T0CKIPPS4                     1193
#define T1CKIPPS0                     1194
#define T1CKIPPS                      1195
#define T1CKIPPS1                     1196
#define T1CKIPPS2                     1197
#define T1CKIPPS3                     1198
#define T1CKIPPS4                     1199
#define T1GPPS0                       1200
#define T1GPPS                        1201
#define T1GPPS1                       1202
#define T1GPPS2                       1203
#define T1GPPS3                       1204
#define T1GPPS4                       1205
#define CCP1PPS0                      1206
#define CCP1PPS                       1207
#define CCP1PPS1                      1208
#define CCP1PPS2                      1209
#define CCP1PPS3                      1210
#define CCP1PPS4                      1211
#define CCP2PPS0                      1212
#define CCP2PPS                       1213
#define CCP2PPS1                      1214
#define CCP2PPS2                      1215
#define CCP2PPS3                      1216
#define CCP2PPS4                      1217
#define CCP3PPS0                      1218
#define CCP3PPS                       1219
#define CCP3PPS1                      1220
#define CCP3PPS2                      1221
#define CCP3PPS3                      1222
#define CCP3PPS4                      1223
#define CCP4PPS0                      1224
#define CCP4PPS                       1225
#define CCP4PPS1                      1226
#define CCP4PPS2                      1227
#define CCP4PPS3                      1228
#define CCP4PPS4                      1229
#define CWG1PPS0                      1230
#define CWG1PPS                       1231
#define CWG1PPS1                      1232
#define CWG1PPS2                      1233
#define CWG1PPS3                      1234
#define CWG1PPS4                      1235
#define CWG2PPS0                      1236
#define CWG2PPS                       1237
#define CWG2PPS1                      1238
#define CWG2PPS2                      1239
#define CWG2PPS3                      1240
#define CWG2PPS4                      1241
#define MDCIN1PPS                     1242
#define MDCIN1PPS0                    1243
#define MDCIN1PPS1                    1244
#define MDCIN1PPS2                    1245
#define MDCIN1PPS3                    1246
#define MDCIN1PPS4                    1247
#define MDCIN2PPS0                    1248
#define MDCIN2PPS                     1249
#define MDCIN2PPS1                    1250
#define MDCIN2PPS2                    1251
#define MDCIN2PPS3                    1252
#define MDCIN2PPS4                    1253
#define MDMINPPS                      1254
#define MDMINPPS0                     1255
#define MDMINPPS1                     1256
#define MDMINPPS2                     1257
#define MDMINPPS3                     1258
#define MDMINPPS4                     1259
#define SSP1CLKPPS0                   1260
#define SSP1CLKPPS                    1261
#define SSP1CLKPPS1                   1262
#define SSP1CLKPPS2                   1263
#define SSP1CLKPPS3                   1264
#define SSP1CLKPPS4                   1265
#define SSP1DATPPS0                   1266
#define SSP1DATPPS                    1267
#define SSP1DATPPS1                   1268
#define SSP1DATPPS2                   1269
#define SSP1DATPPS3                   1270
#define SSP1DATPPS4                   1271
#define SSP1SSPPS                     1272
#define SSP1SSPPS0                    1273
#define SSP1SSPPS1                    1274
#define SSP1SSPPS2                    1275
#define SSP1SSPPS3                    1276
#define SSP1SSPPS4                    1277
#define RXPPS                         1278
#define RXDTPPS0                      1279
#define RXDTPPS1                      1280
#define RXDTPPS2                      1281
#define RXDTPPS3                      1282
#define RXDTPPS4                      1283
#define TXCKPPS0                      1284
#define TXPPS                         1285
#define TXCKPPS1                      1286
#define TXCKPPS2                      1287
#define TXCKPPS3                      1288
#define TXCKPPS4                      1289
#define CLCIN0PPS                     1290
#define CLCIN0PPS0                    1291
#define CLCIN0PPS1                    1292
#define CLCIN0PPS2                    1293
#define CLCIN0PPS3                    1294
#define CLCIN0PPS4                    1295
#define CLCIN1PPS0                    1296
#define CLCIN1PPS                     1297
#define CLCIN1PPS1                    1298
#define CLCIN1PPS2                    1299
#define CLCIN1PPS3                    1300
#define CLCIN1PPS4                    1301
#define CLCIN2PPS                     1302
#define CLCIN2PPS0                    1303
#define CLCIN2PPS1                    1304
#define CLCIN2PPS2                    1305
#define CLCIN2PPS3                    1306
#define CLCIN2PPS4                    1307
#define CLCIN3PPS                     1308
#define CLCIN3PPS0                    1309
#define CLCIN3PPS1                    1310
#define CLCIN3PPS2                    1311
#define CLCIN3PPS3                    1312
#define CLCIN3PPS4                    1313
#define T3CKIPPS                      1314
#define T3GPPS                        1315
#define T5CKIPPS                      1316
#define T5GPPS                        1317
#define RA0PPS                        1318
#define RA0PPS0                       1319
#define RA0PPS1                       1320
#define RA0PPS2                       1321
#define RA0PPS3                       1322
#define RA0PPS4                       1323
#define RA1PPS                        1324
#define RA1PPS0                       1325
#define RA1PPS1                       1326
#define RA1PPS2                       1327
#define RA1PPS3                       1328
#define RA1PPS4                       1329
#define RA2PPS0                       1330
#define RA2PPS                        1331
#define RA2PPS1                       1332
#define RA2PPS2                       1333
#define RA2PPS3                       1334
#define RA2PPS4                       1335
#define RA4PPS                        1336
#define RA4PPS0                       1337
#define RA4PPS1                       1338
#define RA4PPS2                       1339
#define RA4PPS3                       1340
#define RA4PPS4                       1341
#define RA5PPS                        1342
#define RA5PPS0                       1343
#define RA5PPS1                       1344
#define RA5PPS2                       1345
#define RA5PPS3                       1346
#define RA5PPS4                       1347
#define RC0PPS                        1348
#define RC0PPS0                       1349
#define RC0PPS1                       1350
#define RC0PPS2                       1351
#define RC0PPS3                       1352
#define RC0PPS4                       1353
#define RC1PPS0                       1354
#define RC1PPS                        1355
#define RC1PPS1                       1356
#define RC1PPS2                       1357
#define RC1PPS3                       1358
#define RC1PPS4                       1359
#define RC2PPS                        1360
#define RC2PPS0                       1361
#define RC2PPS1                       1362
#define RC2PPS2                       1363
#define RC2PPS3                       1364
#define RC2PPS4                       1365
#define RC3PPS                        1366
#define RC3PPS0                       1367
#define RC3PPS1                       1368
#define RC3PPS2                       1369
#define RC3PPS3                       1370
#define RC3PPS4                       1371
#define RC4PPS0                       1372
#define RC4PPS                        1373
#define RC4PPS1                       1374
#define RC4PPS2                       1375
#define RC4PPS3                       1376
#define RC4PPS4                       1377
#define RC5PPS0                       1378
#define RC5PPS                        1379
#define RC5PPS1                       1380
#define RC5PPS2                       1381
#define RC5PPS3                       1382
#define RC5PPS4                       1383
#define CLCDATA                       1384
#define MLC1OUT                       1385
#define MLC2OUT                       1386
#define MLC3OUT                       1387
#define MLC4OUT                       1388
#define CLC1CON                       1389
#define CLC1CON_MODE0                 1390
#define LC1MODE                       1391
#define CLC1CON_MODE                  1392
#define LC1MODE0                      1393
#define CLC1CON_MODE1                 1394
#define LC1MODE1                      1395
#define LC1MODE2                      1396
#define CLC1CON_MODE2                 1397
#define LC1INTN                       1398
#define CLC1CON_INTN                  1399
#define CLC1CON_INTP                  1400
#define LC1INTP                       1401
#define LC1OUT                        1402
#define CLC1CON_OUT                   1403
#define CLC1CON_EN                    1404
#define LC1EN                         1405
#define CLC1POL                       1406
#define LC1G1POL                      1407
#define CLC1POL_G1POL                 1408
#define CLC1POL_G2POL                 1409
#define LC1G2POL                      1410
#define LC1G3POL                      1411
#define CLC1POL_G3POL                 1412
#define LC1G4POL                      1413
#define CLC1POL_G4POL                 1414
#define CLC1POL_POL                   1415
#define LC1POL                        1416
#define CLC1SEL0                      1417
#define CLC1SEL0_D1S0                 1418
#define LC1D1S0                       1419
#define CLC1SEL0_D1S                  1420
#define LC1D1S                        1421
#define CLC1SEL0_D1S1                 1422
#define LC1D1S1                       1423
#define CLC1SEL0_D1S2                 1424
#define LC1D1S2                       1425
#define LC1D1S3                       1426
#define CLC1SEL0_D1S3                 1427
#define CLC1SEL0_D1S4                 1428
#define LC1D1S4                       1429
#define CLC1SEL0_D1S5                 1430
#define LC1D1S5                       1431
#define CLC1SEL1                      1432
#define CLC1SEL1_D2S0                 1433
#define CLC1SEL1_D2S                  1434
#define LC1D2S                        1435
#define LC1D2S0                       1436
#define CLC1SEL1_D2S1                 1437
#define LC1D2S1                       1438
#define CLC1SEL1_D2S2                 1439
#define LC1D2S2                       1440
#define LC1D2S3                       1441
#define CLC1SEL1_D2S3                 1442
#define LC1D2S4                       1443
#define CLC1SEL1_D2S4                 1444
#define LC1D2S5                       1445
#define CLC1SEL1_D2S5                 1446
#define CLC1SEL2                      1447
#define LC1D3S0                       1448
#define CLC1SEL2_D3S                  1449
#define LC1D3S                        1450
#define CLC1SEL2_D3S0                 1451
#define LC1D3S1                       1452
#define CLC1SEL2_D3S1                 1453
#define LC1D3S2                       1454
#define CLC1SEL2_D3S2                 1455
#define LC1D3S3                       1456
#define CLC1SEL2_D3S3                 1457
#define LC1D3S4                       1458
#define CLC1SEL2_D3S4                 1459
#define LC1D3S5                       1460
#define CLC1SEL2_D3S5                 1461
#define CLC1SEL3                      1462
#define CLC1SEL3_D4S                  1463
#define LC1D4S                        1464
#define LC1D4S0                       1465
#define CLC1SEL3_D4S0                 1466
#define CLC1SEL3_D4S1                 1467
#define LC1D4S1                       1468
#define LC1D4S2                       1469
#define CLC1SEL3_D4S2                 1470
#define LC1D4S3                       1471
#define CLC1SEL3_D4S3                 1472
#define LC1D4S4                       1473
#define CLC1SEL3_D4S4                 1474
#define LC1D4S5                       1475
#define CLC1SEL3_D4S5                 1476
#define CLC1GLS0                      1477
#define CLC1GLS0_D1N                  1478
#define LC1G1D1N                      1479
#define CLC1GLS0_D1T                  1480
#define LC1G1D1T                      1481
#define LC1G1D2N                      1482
#define CLC1GLS0_D2N                  1483
#define LC1G1D2T                      1484
#define CLC1GLS0_D2T                  1485
#define CLC1GLS0_D3N                  1486
#define LC1G1D3N                      1487
#define CLC1GLS0_D3T                  1488
#define LC1G1D3T                      1489
#define CLC1GLS0_D4N                  1490
#define LC1G1D4N                      1491
#define CLC1GLS0_D4T                  1492
#define LC1G1D4T                      1493
#define CLC1GLS1                      1494
#define CLC1GLS1_D1N                  1495
#define LC1G2D1N                      1496
#define LC1G2D1T                      1497
#define CLC1GLS1_D1T                  1498
#define CLC1GLS1_D2N                  1499
#define LC1G2D2N                      1500
#define LC1G2D2T                      1501
#define CLC1GLS1_D2T                  1502
#define CLC1GLS1_D3N                  1503
#define LC1G2D3N                      1504
#define LC1G2D3T                      1505
#define CLC1GLS1_D3T                  1506
#define CLC1GLS1_D4N                  1507
#define LC1G2D4N                      1508
#define LC1G2D4T                      1509
#define CLC1GLS1_D4T                  1510
#define CLC1GLS2                      1511
#define CLC1GLS2_D1N                  1512
#define LC1G3D1N                      1513
#define LC1G3D1T                      1514
#define CLC1GLS2_D1T                  1515
#define LC1G3D2N                      1516
#define CLC1GLS2_D2N                  1517
#define LC1G3D2T                      1518
#define CLC1GLS2_D2T                  1519
#define CLC1GLS2_D3N                  1520
#define LC1G3D3N                      1521
#define LC1G3D3T                      1522
#define CLC1GLS2_D3T                  1523
#define LC1G3D4N                      1524
#define CLC1GLS2_D4N                  1525
#define LC1G3D4T                      1526
#define CLC1GLS2_D4T                  1527
#define CLC1GLS3                      1528
#define LC1G4D1N                      1529
#define CLC1GLS3_G4D1N                1530
#define LC1G4D1T                      1531
#define CLC1GLS3_G4D1T                1532
#define CLC1GLS3_G4D2N                1533
#define LC1G4D2N                      1534
#define CLC1GLS3_G4D2T                1535
#define LC1G4D2T                      1536
#define LC1G4D3N                      1537
#define CLC1GLS3_G4D3N                1538
#define LC1G4D3T                      1539
#define CLC1GLS3_G4D3T                1540
#define CLC1GLS3_G4D4N                1541
#define LC1G4D4N                      1542
#define CLC1GLS3_G4D4T                1543
#define LC1G4D4T                      1544
#define CLC2CON                       1545
#define LC2MODE0                      1546
#define CLC2CON_MODE                  1547
#define LC2MODE                       1548
#define CLC2CON_MODE0                 1549
#define LC2MODE1                      1550
#define CLC2CON_MODE1                 1551
#define LC2MODE2                      1552
#define CLC2CON_MODE2                 1553
#define LC2INTN                       1554
#define CLC2CON_INTN                  1555
#define LC2INTP                       1556
#define CLC2CON_INTP                  1557
#define CLC2CON_OUT                   1558
#define LC2OUT                        1559
#define CLC2CON_EN                    1560
#define LC2EN                         1561
#define CLC2POL                       1562
#define LC2G1POL                      1563
#define CLC2POL_G1POL                 1564
#define LC2G2POL                      1565
#define CLC2POL_G2POL                 1566
#define LC2G3POL                      1567
#define CLC2POL_G3POL                 1568
#define LC2G4POL                      1569
#define CLC2POL_G4POL                 1570
#define CLC2POL_POL                   1571
#define LC2POL                        1572
#define CLC2SEL0                      1573
#define CLC2SEL0_D1S                  1574
#define LC2D1S0                       1575
#define CLC2SEL0_D1S0                 1576
#define LC2D1S                        1577
#define LC2D1S1                       1578
#define CLC2SEL0_D1S1                 1579
#define LC2D1S2                       1580
#define CLC2SEL0_D1S2                 1581
#define CLC2SEL0_D1S3                 1582
#define LC2D1S3                       1583
#define LC2D1S4                       1584
#define CLC2SEL0_D1S4                 1585
#define LC2D1S5                       1586
#define CLC2SEL0_D1S5                 1587
#define CLC2SEL1                      1588
#define LC2D2S0                       1589
#define CLC2SEL1_D2S0                 1590
#define LC2D2S                        1591
#define CLC2SEL1_D2S                  1592
#define LC2D2S1                       1593
#define CLC2SEL1_D2S1                 1594
#define LC2D2S2                       1595
#define CLC2SEL1_D2S2                 1596
#define LC2D2S3                       1597
#define CLC2SEL1_D2S3                 1598
#define LC2D2S4                       1599
#define CLC2SEL1_D2S4                 1600
#define LC2D2S5                       1601
#define CLC2SEL1_D2S5                 1602
#define CLC2SEL2                      1603
#define CLC2SEL2_D3S                  1604
#define LC2D3S0                       1605
#define CLC2SEL2_D3S0                 1606
#define LC2D3S                        1607
#define CLC2SEL2_D3S1                 1608
#define LC2D3S1                       1609
#define LC2D3S2                       1610
#define CLC2SEL2_D3S2                 1611
#define LC2D3S3                       1612
#define CLC2SEL2_D3S3                 1613
#define LC2D3S4                       1614
#define CLC2SEL2_D3S4                 1615
#define LC2D3S5                       1616
#define CLC2SEL2_D3S5                 1617
#define CLC2SEL3                      1618
#define LC2D4S0                       1619
#define CLC2SEL3_D4S                  1620
#define CLC2SEL3_D4S0                 1621
#define LC2D4S                        1622
#define LC2D4S1                       1623
#define CLC2SEL3_D4S1                 1624
#define LC2D4S2                       1625
#define CLC2SEL3_D4S2                 1626
#define CLC2SEL3_D4S3                 1627
#define LC2D4S3                       1628
#define LC2D4S4                       1629
#define CLC2SEL3_D4S4                 1630
#define LC2D4S5                       1631
#define CLC2SEL3_D4S5                 1632
#define CLC2GLS0                      1633
#define LC2G1D1N                      1634
#define CLC2GLS0_D1N                  1635
#define CLC2GLS0_D1T                  1636
#define LC2G1D1T                      1637
#define LC2G1D2N                      1638
#define CLC2GLS0_D2N                  1639
#define CLC2GLS0_D2T                  1640
#define LC2G1D2T                      1641
#define LC2G1D3N                      1642
#define CLC2GLS0_D3N                  1643
#define CLC2GLS0_D3T                  1644
#define LC2G1D3T                      1645
#define LC2G1D4N                      1646
#define CLC2GLS0_D4N                  1647
#define CLC2GLS0_D4T                  1648
