tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18324_tdd.h
#define LC2G1D4T                      1649
#define CLC2GLS1                      1650
#define CLC2GLS1_D1N                  1651
#define LC2G2D1N                      1652
#define CLC2GLS1_D1T                  1653
#define LC2G2D1T                      1654
#define CLC2GLS1_D2N                  1655
#define LC2G2D2N                      1656
#define CLC2GLS1_D2T                  1657
#define LC2G2D2T                      1658
#define LC2G2D3N                      1659
#define CLC2GLS1_D3N                  1660
#define LC2G2D3T                      1661
#define CLC2GLS1_D3T                  1662
#define LC2G2D4N                      1663
#define CLC2GLS1_D4N                  1664
#define LC2G2D4T                      1665
#define CLC2GLS1_D4T                  1666
#define CLC2GLS2                      1667
#define LC2G3D1N                      1668
#define CLC2GLS2_D1N                  1669
#define CLC2GLS2_D1T                  1670
#define LC2G3D1T                      1671
#define CLC2GLS2_D2N                  1672
#define LC2G3D2N                      1673
#define LC2G3D2T                      1674
#define CLC2GLS2_D2T                  1675
#define CLC2GLS2_D3N                  1676
#define LC2G3D3N                      1677
#define CLC2GLS2_D3T                  1678
#define LC2G3D3T                      1679
#define CLC2GLS2_D4N                  1680
#define LC2G3D4N                      1681
#define LC2G3D4T                      1682
#define CLC2GLS2_D4T                  1683
#define CLC2GLS3                      1684
#define LC2G4D1N                      1685
#define CLC2GLS3_G4D1N                1686
#define CLC2GLS3_G4D1T                1687
#define LC2G4D1T                      1688
#define CLC2GLS3_G4D2N                1689
#define LC2G4D2N                      1690
#define LC2G4D2T                      1691
#define CLC2GLS3_G4D2T                1692
#define CLC2GLS3_G4D3N                1693
#define LC2G4D3N                      1694
#define CLC2GLS3_G4D3T                1695
#define LC2G4D3T                      1696
#define LC2G4D4N                      1697
#define CLC2GLS3_G4D4N                1698
#define CLC2GLS3_G4D4T                1699
#define LC2G4D4T                      1700
#define CLC3CON                       1701
#define LC3MODE                       1702
#define CLC3CON_MODE0                 1703
#define LC3MODE0                      1704
#define CLC3CON_MODE                  1705
#define CLC3CON_MODE1                 1706
#define LC3MODE1                      1707
#define CLC3CON_MODE2                 1708
#define LC3MODE2                      1709
#define LC3INTN                       1710
#define CLC3CON_INTN                  1711
#define LC3INTP                       1712
#define CLC3CON_INTP                  1713
#define LC3OUT                        1714
#define CLC3CON_OUT                   1715
#define LC3EN                         1716
#define CLC3CON_EN                    1717
#define CLC3POL                       1718
#define LC3G1POL                      1719
#define CLC3POL_G1POL                 1720
#define LC3G2POL                      1721
#define CLC3POL_G2POL                 1722
#define CLC3POL_G3POL                 1723
#define LC3G3POL                      1724
#define LC3G4POL                      1725
#define CLC3POL_G4POL                 1726
#define LC3POL                        1727
#define CLC3POL_POL                   1728
#define CLC3SEL0                      1729
#define CLC3SEL0_D1S0                 1730
#define LC3D1S0                       1731
#define CLC3SEL0_D1S                  1732
#define LC3D1S                        1733
#define LC3D1S1                       1734
#define CLC3SEL0_D1S1                 1735
#define LC3D1S2                       1736
#define CLC3SEL0_D1S2                 1737
#define LC3D1S3                       1738
#define CLC3SEL0_D1S3                 1739
#define LC3D1S4                       1740
#define CLC3SEL0_D1S4                 1741
#define LC3D1S5                       1742
#define CLC3SEL0_D1S5                 1743
#define CLC3SEL1                      1744
#define CLC3SEL1_D2S                  1745
#define CLC3SEL1_D2S0                 1746
#define LC3D2S                        1747
#define LC3D2S0                       1748
#define CLC3SEL1_D2S1                 1749
#define LC3D2S1                       1750
#define CLC3SEL1_D2S2                 1751
#define LC3D2S2                       1752
#define CLC3SEL1_D2S3                 1753
#define LC3D2S3                       1754
#define CLC3SEL1_D2S4                 1755
#define LC3D2S4                       1756
#define CLC3SEL1_D2S5                 1757
#define LC3D2S5                       1758
#define CLC3SEL2                      1759
#define LC3D3S                        1760
#define CLC3SEL2_D3S                  1761
#define LC3D3S0                       1762
#define CLC3SEL2_D3S0                 1763
#define LC3D3S1                       1764
#define CLC3SEL2_D3S1                 1765
#define LC3D3S2                       1766
#define CLC3SEL2_D3S2                 1767
#define LC3D3S3                       1768
#define CLC3SEL2_D3S3                 1769
#define CLC3SEL2_D3S4                 1770
#define LC3D3S4                       1771
#define CLC3SEL2_D3S5                 1772
#define LC3D3S5                       1773
#define CLC3SEL3                      1774
#define CLC3SEL3_D4S0                 1775
#define LC3D4S0                       1776
#define CLC3SEL3_D4S                  1777
#define LC3D4S                        1778
#define LC3D4S1                       1779
#define CLC3SEL3_D4S1                 1780
#define LC3D4S2                       1781
#define CLC3SEL3_D4S2                 1782
#define LC3D4S3                       1783
#define CLC3SEL3_D4S3                 1784
#define LC3D4S4                       1785
#define CLC3SEL3_D4S4                 1786
#define LC3D4S5                       1787
#define CLC3SEL3_D4S5                 1788
#define CLC3GLS0                      1789
#define CLC3GLS0_D1N                  1790
#define LC3G1D1N                      1791
#define LC3G1D1T                      1792
#define CLC3GLS0_D1T                  1793
#define LC3G1D2N                      1794
#define CLC3GLS0_D2N                  1795
#define CLC3GLS0_D2T                  1796
#define LC3G1D2T                      1797
#define CLC3GLS0_D3N                  1798
#define LC3G1D3N                      1799
#define LC3G1D3T                      1800
#define CLC3GLS0_D3T                  1801
#define CLC3GLS0_D4N                  1802
#define LC3G1D4N                      1803
#define CLC3GLS0_D4T                  1804
#define LC3G1D4T                      1805
#define CLC3GLS1                      1806
#define LC3G2D1N                      1807
#define CLC3GLS1_D1N                  1808
#define CLC3GLS1_D1T                  1809
#define LC3G2D1T                      1810
#define LC3G2D2N                      1811
#define CLC3GLS1_D2N                  1812
#define LC3G2D2T                      1813
#define CLC3GLS1_D2T                  1814
#define LC3G2D3N                      1815
#define CLC3GLS1_D3N                  1816
#define CLC3GLS1_D3T                  1817
#define LC3G2D3T                      1818
#define LC3G2D4N                      1819
#define CLC3GLS1_D4N                  1820
#define LC3G2D4T                      1821
#define CLC3GLS1_D4T                  1822
#define CLC3GLS2                      1823
#define LC3G3D1N                      1824
#define CLC3GLS2_D1N                  1825
#define LC3G3D1T                      1826
#define CLC3GLS2_D1T                  1827
#define CLC3GLS2_D2N                  1828
#define LC3G3D2N                      1829
#define CLC3GLS2_D2T                  1830
#define LC3G3D2T                      1831
#define CLC3GLS2_D3N                  1832
#define LC3G3D3N                      1833
#define LC3G3D3T                      1834
#define CLC3GLS2_D3T                  1835
#define CLC3GLS2_D4N                  1836
#define LC3G3D4N                      1837
#define CLC3GLS2_D4T                  1838
#define LC3G3D4T                      1839
#define CLC3GLS3                      1840
#define LC3G4D1N                      1841
#define CLC3GLS3_G4D1N                1842
#define LC3G4D1T                      1843
#define CLC3GLS3_G4D1T                1844
#define LC3G4D2N                      1845
#define CLC3GLS3_G4D2N                1846
#define CLC3GLS3_G4D2T                1847
#define LC3G4D2T                      1848
#define LC3G4D3N                      1849
#define CLC3GLS3_G4D3N                1850
#define CLC3GLS3_G4D3T                1851
#define LC3G4D3T                      1852
#define LC3G4D4N                      1853
#define CLC3GLS3_G4D4N                1854
#define LC3G4D4T                      1855
#define CLC3GLS3_G4D4T                1856
#define CLC4CON                       1857
#define LC4MODE                       1858
#define CLC4CON_MODE                  1859
#define LC4MODE0                      1860
#define CLC4CON_MODE0                 1861
#define LC4MODE1                      1862
#define CLC4CON_MODE1                 1863
#define LC4MODE2                      1864
#define CLC4CON_MODE2                 1865
#define LC4INTN                       1866
#define CLC4CON_INTN                  1867
#define CLC4CON_INTP                  1868
#define LC4INTP                       1869
#define CLC4CON_OUT                   1870
#define LC4OUT                        1871
#define CLC4CON_EN                    1872
#define LC4EN                         1873
#define CLC4POL                       1874
#define CLC4POL_G1POL                 1875
#define LC4G1POL                      1876
#define CLC4POL_G2POL                 1877
#define LC4G2POL                      1878
#define CLC4POL_G3POL                 1879
#define LC4G3POL                      1880
#define LC4G4POL                      1881
#define CLC4POL_G4POL                 1882
#define LC4POL                        1883
#define CLC4POL_POL                   1884
#define CLC4SEL0                      1885
#define CLC4SEL0_D1S0                 1886
#define LC4D1S0                       1887
#define CLC4SEL0_D1S                  1888
#define LC4D1S                        1889
#define CLC4SEL0_D1S1                 1890
#define LC4D1S1                       1891
#define CLC4SEL0_D1S2                 1892
#define LC4D1S2                       1893
#define CLC4SEL0_D1S3                 1894
#define LC4D1S3                       1895
#define CLC4SEL0_D1S4                 1896
#define LC4D1S4                       1897
#define CLC4SEL0_D1S5                 1898
#define LC4D1S5                       1899
#define CLC4SEL1                      1900
#define LC4D2S0                       1901
#define CLC4SEL1_D2S                  1902
#define CLC4SEL1_D2S0                 1903
#define LC4D2S                        1904
#define CLC4SEL1_D2S1                 1905
#define LC4D2S1                       1906
#define LC4D2S2                       1907
#define CLC4SEL1_D2S2                 1908
#define LC4D2S3                       1909
#define CLC4SEL1_D2S3                 1910
#define LC4D2S4                       1911
#define CLC4SEL1_D2S4                 1912
#define LC4D2S5                       1913
#define CLC4SEL1_D2S5                 1914
#define CLC4SEL2                      1915
#define LC4D3S                        1916
#define CLC4SEL2_D3S                  1917
#define CLC4SEL2_D3S0                 1918
#define LC4D3S0                       1919
#define LC4D3S1                       1920
#define CLC4SEL2_D3S1                 1921
#define CLC4SEL2_D3S2                 1922
#define LC4D3S2                       1923
#define CLC4SEL2_D3S3                 1924
#define LC4D3S3                       1925
#define CLC4SEL2_D3S4                 1926
#define LC4D3S4                       1927
#define CLC4SEL2_D3S5                 1928
#define LC4D3S5                       1929
#define CLC4SEL3                      1930
#define LC4D4S0                       1931
#define LC4D4S                        1932
#define CLC4SEL3_D4S0                 1933
#define CLC4SEL3_D4S                  1934
#define LC4D4S1                       1935
#define CLC4SEL3_D4S1                 1936
#define LC4D4S2                       1937
#define CLC4SEL3_D4S2                 1938
#define LC4D4S3                       1939
#define CLC4SEL3_D4S3                 1940
#define LC4D4S4                       1941
#define CLC4SEL3_D4S4                 1942
#define LC4D4S5                       1943
#define CLC4SEL3_D4S5                 1944
#define CLC4GLS0                      1945
#define CLC4GLS0_D1N                  1946
#define LC4G1D1N                      1947
#define CLC4GLS0_D1T                  1948
#define LC4G1D1T                      1949
#define CLC4GLS0_D2N                  1950
#define LC4G1D2N                      1951
#define CLC4GLS0_D2T                  1952
#define LC4G1D2T                      1953
#define CLC4GLS0_D3N                  1954
#define LC4G1D3N                      1955
#define CLC4GLS0_D3T                  1956
#define LC4G1D3T                      1957
#define CLC4GLS0_D4N                  1958
#define LC4G1D4N                      1959
#define CLC4GLS0_D4T                  1960
#define LC4G1D4T                      1961
#define CLC4GLS1                      1962
#define CLC4GLS1_D1N                  1963
#define LC4G2D1N                      1964
#define CLC4GLS1_D1T                  1965
#define LC4G2D1T                      1966
#define LC4G2D2N                      1967
#define CLC4GLS1_D2N                  1968
#define LC4G2D2T                      1969
#define CLC4GLS1_D2T                  1970
#define CLC4GLS1_D3N                  1971
#define LC4G2D3N                      1972
#define LC4G2D3T                      1973
#define CLC4GLS1_D3T                  1974
#define CLC4GLS1_D4N                  1975
#define LC4G2D4N                      1976
#define CLC4GLS1_D4T                  1977
#define LC4G2D4T                      1978
#define CLC4GLS2                      1979
#define CLC4GLS2_D1N                  1980
#define LC4G3D1N                      1981
#define CLC4GLS2_D1T                  1982
#define LC4G3D1T                      1983
#define LC4G3D2N                      1984
#define CLC4GLS2_D2N                  1985
#define LC4G3D2T                      1986
#define CLC4GLS2_D2T                  1987
#define CLC4GLS2_D3N                  1988
#define LC4G3D3N                      1989
#define CLC4GLS2_D3T                  1990
#define LC4G3D3T                      1991
#define LC4G3D4N                      1992
#define CLC4GLS2_D4N                  1993
#define LC4G3D4T                      1994
#define CLC4GLS2_D4T                  1995
#define CLC4GLS3                      1996
#define CLC4GLS3_G4D1N                1997
#define LC4G4D1N                      1998
#define LC4G4D1T                      1999
#define CLC4GLS3_G4D1T                2000
#define LC4G4D2N                      2001
#define CLC4GLS3_G4D2N                2002
#define LC4G4D2T                      2003
#define CLC4GLS3_G4D2T                2004
#define CLC4GLS3_G4D3N                2005
#define LC4G4D3N                      2006
#define CLC4GLS3_G4D3T                2007
#define LC4G4D3T                      2008
#define LC4G4D4N                      2009
#define CLC4GLS3_G4D4N                2010
#define LC4G4D4T                      2011
#define CLC4GLS3_G4D4T                2012
#define STATUS_SHAD                   2013
#define C_SHAD                        2014
#define DC_SHAD                       2015
#define Z_SHAD                        2016
#define WREG_SHAD                     2017
#define BSR_SHAD                      2018
#define PCLATH_SHAD                   2019
#define FSR0L_SHAD                    2020
#define FSR0H_SHAD                    2021
#define FSR1L_SHAD                    2022
#define FSR1H_SHAD                    2023
#define STKPTR                        2024
#define TOSL                          2025
#define TOSH                          2026

#endif // _PIC16LF18324_H_
